## Plan Result (883: prod_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;05-ingest05-logic-prod-Group-Owner-DTS Crime Legacy Data Migration Admin (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logic-prod-Group-Reader-DTS Crime Legacy Data Migration User (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logic-prod-Group-Storage-Blob-Data-Owner-DTS Crime Legacy Data Migration Admin (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-prod-Group-Owner-DTS Crime Legacy Data Migration Admin (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-prod-Group-Reader-DTS Crime Legacy Data Migration User (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-prod-Group-Storage-Blob-Data-Owner-DTS Crime Legacy Data Migration Admin (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-network-prod-Group-Owner-DTS Crime Legacy Data Migration Admin (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-network-prod-Group-Reader-DTS Crime Legacy Data Migration User (env:production)&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-network-prod-Group-Storage-Blob-Data-Owner-DTS Crime Legacy Data Migration Admin (env:production)&#34;]
* Delete
  * azurerm_role_assignment.roles[&#34;05-ingest05-logic-prod-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logic-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-prod-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-network-prod-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-network-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["05-ingest05-logic-prod-Group-Owner-DTS Crime Legacy Data Migration Admin (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3a7d07a3-dcf8-45f1-aefd-f5f5835bca81"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-logic-prod-Group-Reader-DTS Crime Legacy Data Migration User (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bf6b5eb0-f8a0-4764-a283-042e9e09ab51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-logic-prod-Group-Storage-Blob-Data-Owner-DTS Crime Legacy Data Migration Admin (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3a7d07a3-dcf8-45f1-aefd-f5f5835bca81"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-logic-prod-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-logic-prod-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod/providers/Microsoft.Authorization/roleAssignments/58472c51-16c7-6a55-7b7c-411a8ba193ad" -> null
      - name                                   = "58472c51-16c7-6a55-7b7c-411a8ba193ad" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-logic-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-logic-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod/providers/Microsoft.Authorization/roleAssignments/38004ab6-751b-6cf4-11d3-f1f15ac9746e" -> null
      - name                                   = "38004ab6-751b-6cf4-11d3-f1f15ac9746e" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-logic-prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-prod-Group-Owner-DTS Crime Legacy Data Migration Admin (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3a7d07a3-dcf8-45f1-aefd-f5f5835bca81"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-prod-Group-Reader-DTS Crime Legacy Data Migration User (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bf6b5eb0-f8a0-4764-a283-042e9e09ab51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-prod-Group-Storage-Blob-Data-Owner-DTS Crime Legacy Data Migration Admin (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3a7d07a3-dcf8-45f1-aefd-f5f5835bca81"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-prod-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-main-prod-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Authorization/roleAssignments/9643ceca-d47f-10f9-cbe8-71f5c68ec004" -> null
      - name                                   = "9643ceca-d47f-10f9-cbe8-71f5c68ec004" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-main-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Authorization/roleAssignments/d47f5d52-91be-80e5-a93c-e1a3b25571c4" -> null
      - name                                   = "d47f5d52-91be-80e5-a93c-e1a3b25571c4" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-network-prod-Group-Owner-DTS Crime Legacy Data Migration Admin (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3a7d07a3-dcf8-45f1-aefd-f5f5835bca81"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-network-prod-Group-Reader-DTS Crime Legacy Data Migration User (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bf6b5eb0-f8a0-4764-a283-042e9e09ab51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-network-prod-Group-Storage-Blob-Data-Owner-DTS Crime Legacy Data Migration Admin (env:production)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3a7d07a3-dcf8-45f1-aefd-f5f5835bca81"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-network-prod-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-network-prod-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod/providers/Microsoft.Authorization/roleAssignments/123f3399-e2c6-1567-aff5-c7a8a52d2b95" -> null
      - name                                   = "123f3399-e2c6-1567-aff5-c7a8a52d2b95" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-network-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-network-prod-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod/providers/Microsoft.Authorization/roleAssignments/757df89d-c6d5-2c3a-9be5-c147eac0ef60" -> null
      - name                                   = "757df89d-c6d5-2c3a-9be5-c147eac0ef60" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-network-prod" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":125,"Program":"tfcmt","SHA1":"","Target":"883: prod_landing - TerraformPlanApply","Vars":{}} -->